{
  "embeds": [
    {
      "title": "**Sessions:**",
      "color": 5793266,
      "fields": [
        {
          "name": "**What does it do?**",
          "value": "Sessions track stats and are used for commands like `/prestige`, `/milestones`, and `/2024`. They start when initiated and record all subsequent stats. Sessions can be managed with commands like `/session`, `/startsession`, `/endsession`, and `/resetsession`. Session stats are used for calculations and can be deleted or reset. Session management requires being linked."
        },
        {
          "name": "**Commands:**",
          "value": "`/session` - view session\n`/startsession` - start a session\n`/resetsession` - reset a session\n`/endsession` - delete a session"
        }
      ]
    },
    {
      "title": "**Projection:**",
      "color": 5793266,
      "fields": [
        {
          "name": "**What does it do?**",
          "value": "The Bedwars Stat Projection feature allows easy access to your stats at any star level. Using the `/prestige` command provides a detailed breakdown of anticipated statistics and their projected date. It relies on session stats for accurate forecasting, so having a substantial session beforehand is recommended for precise results. You can specify a session for projections or it defaults to session 1. Additionally, the `/2024` command predicts your stats for the year 2024, offering a quick overview of your future performance in that specific timeframe."
        },
        {
          "name": "**Commands:**",
          "value": "`/prestige` - view projected stats\n`/2024` - view next year's stats"
        }
      ]
    },
    {
      "title": "**Comparison:**",
      "color": 5793266,
      "fields": [
        {
          "name": "**What does it do?**",
          "value": "The Stat Comparison feature enables users to easily compare the statistical performance of two players. To access this feature, simply execute the `/compare` command and provide the names of the two players you wish to compare. If your account is linked, specifying only one player will automatically compare your own stats with those of the first player."
        },
        {
          "name": "**Commands:**",
          "value": "`/compare` - view stat comparison"
        }
      ]
    },
    {
      "title": "**Historical:**",
      "color": 5793266,
      "fields": [
        {
          "name": "**What does it do?**",
          "value": "The daily, weekly, monthly, and yearly commands allow you to track your current real-time stats for the corresponding time periods. They provide an overview of your performance within the current day, week, month, or year. On the other hand, the lastday, lastweek, lastmonth, and lastyear commands offer insights into your previous stats, giving you a summary of your performance in the respective time frames."
        },
        {
          "name": "**Commands:**",
          "value": "`/daily` - view the current daily stats\n`/weekly` - view the current weekly stats\n`/monthly` - view current monthly stats\n`/yearly` - view current yearly stats\n`/lastday` - view yesterdays stats\n`/lastweek` - view last weeks stats\n`/lastmonth` - view last months stats\n`/lastyear` - view last years stats"
        }
      ]
    },
    {
      "title": "**Linking:**",
      "color": 5793266,
      "fields": [
        {
          "name": "**What does it do?**",
          "value": "Linking your account is a quality-of-life feature that offers several benefits, such as the ability to use commands without specifying a player, manage your sessions, and more. We highly recommend that you take advantage of this feature. To begin, make sure that your Discord account is connected to Hypixel with your __current__ Discord tag. Then, complete the linking process by executing the` /link <ign>` command."
        },
        {
          "name": "**Commands:**",
          "value": "`/link` - link your account\n`/unlink` - unlink your account"
        }
      ]
    },
    {
      "title": "**Other Commands:**",
      "description": "`/shop` - view the shop of any player\n`/mostplayed` - view most played modes of any player\n`/bedwars` - view general bedwars stats of any player\n`/average` - view average stats and rations of any player\n`/resources` - view resource stats of any player\n`/skin` - view or save the skin of any player\n`/practice` - view practice stats of any player\n`/milestones` - view milestone stats of any player\n`/activecosmetics` - view the active cosmetics of any player\n`/activesession` - get a list of all your active sessions\n`/hotbar` - view the hotbar preference of any player\n`/pointless` - same as /bedwars but really pointless\n`/who` convert name to uuid & vice versa\n`/displayname` - renders the bedwars displayname of a player",
      "color": 5793266
    }
  ]
}
